app/controllers/welcome_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @order = Order.new
    @posts = Post.all